Revit 2027 API
AnalyzesAsType Enumeration
 This enum class is used for the BuiltInParameter STRUCTURAL_ANALYZES_AS.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AnalyzesAsType
Public Enumeration AnalyzesAsType
public enum class AnalyzesAsType
type AnalyzesAsType
Members
Member name | Value | Description
AA_Gravity | 1
AA_GravityLateral | 8
AA_Hanger | 0
AA_Lateral | 2
AA_Mat | 4
AA_Not_For_Analysis | 6
AA_SlabOneWay | 3
AA_SlabOnGrade | 5
AA_SlabTwoWay | 7
See Also
Reference
Autodesk.Revit.DB Namespace